var clothes = [
    //制作
    //修罗之魇
    {"装颜": "红", "Name": "牛角帽", "Sex": "男", "Type": "头饰", "帽子": 3, "精致": 3, "恐怖": 4, "鬼": 5},
    {"装颜": "红", "Name": "命悬", "Sex": "男", "Type": "发型", "披发": 3, "精致": 3, "恐怖": 4, "鬼": 5},
    {"装颜": "红", "Name": "暗黑口罩", "Sex": "男", "Type": "配饰", "精致": 3, "刺客": 4, "帽子": 5, "鬼": 4},
    {"装颜": "红", "Name": "修罗袍", "Sex": "男", "Type": "服饰", "黑": 4, "鬼": 4, "恐怖": 4, "刺客": 5},
    {"装颜": "红", "Name": "修罗带", "Sex": "男", "Type": "缀饰", "青春": 3, "风流": 4, "繁华": 4, "礼服": 5},
    {"装颜": "红", "Name": "烈火刃", "Sex": "男", "Type": "手持", "精致": 3, "刺客": 4, "恐怖": 5, "鬼": 4},
    //九龙在天
    {"装颜": "橙", "Name": "龙章麟角", "Sex": "男", "Type": "头饰", "青春": 3, "演戏": 4, "勇猛": 5, "精致": 2},
    {"装颜": "橙", "Name": "矫若游龙", "Sex": "男", "Type": "发型", "青春": 2, "简约": 3, "勇猛": 4, "武士": 3},
    {"装颜": "橙", "Name": "飞龙在天", "Sex": "男", "Type": "配饰", "成熟": 3, "精致": 2, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "天之骄子", "Sex": "男", "Type": "服饰", "保暖": 4, "战争": 3, "威严": 4, "甲胄": 3},
    {"装颜": "橙", "Name": "乘龙玉佩", "Sex": "男", "Type": "缀饰", "成熟": 2, "官服": 3, "儒雅": 4, "精致": 3},
    {"装颜": "橙", "Name": "伏虎降龙", "Sex": "男", "Type": "手持", "青春": 3, "战争": 4, "勇猛": 5, "繁华": 3},
    //临烟百战
    {"装颜": "紫", "Name": "白羽发带", "Sex": "男", "Type": "头饰", "侠客": 3, "战争": 3, "勇猛": 4, "匈奴": 2},
    {"装颜": "紫", "Name": "疾如烈", "Sex": "男", "Type": "发型", "黑": 3, "战争": 3, "勇猛": 4, "简约": 2},
    {"装颜": "紫", "Name": "易水肩甲", "Sex": "男", "Type": "配饰", "侠客": 3, "战争": 3, "勇猛": 4, "肩甲": 3},
    {"装颜": "紫", "Name": "百战金甲", "Sex": "男", "Type": "服饰", "侠客": 3, "战争": 3, "勇猛": 4, "甲胄": 2},
    {"装颜": "紫", "Name": "照霜佩", "Sex": "男", "Type": "缀饰", "汉族": 3, "战争": 3, "风流": 4, "精致": 3},
    {"装颜": "紫", "Name": "掩月弓", "Sex": "男", "Type": "手持", "黑": 3, "侠客": 3, "勇猛": 4, "武器": 3},
    //缥缈笙歌
    {"装颜": "紫", "Name": "风归云", "Sex": "男", "Type": "头饰", "演戏": 3, "风流": 3, "舞蹈": 4, "精致": 3},
    {"装颜": "紫", "Name": "南风", "Sex": "男", "Type": "发型", "青春": 3, "风流": 3, "舞蹈": 4, "古代": 2},
    {"装颜": "紫", "Name": "花舞", "Sex": "男", "Type": "配饰", "汉族": 1, "精致": 2, "舞蹈": 4, "礼服": 3},
    {"装颜": "紫", "Name": "钟离春", "Sex": "男", "Type": "服饰", "适温": 3, "风流": 3, "舞蹈": 4, "繁华": 3},
    {"装颜": "紫", "Name": "蓬莱涧", "Sex": "男", "Type": "缀饰", "汉族": 2, "休闲": 2, "精致": 2, "礼服": 4},
    {"装颜": "紫", "Name": "清波烟斗", "Sex": "男", "Type": "手持", "古代": 2, "玩偶": 2, "舞蹈": 4, "休闲": 1},
    //锦裘青衣
    {"装颜": "紫", "Name": "锦貂冠", "Sex": "男", "Type": "头饰", "冠": 2, "侠客": 2, "勇猛": 4, "礼服": 2},
    {"装颜": "紫", "Name": "良辰", "Sex": "男", "Type": "发型", "青春": 3, "精致": 3, "侠客": 3, "休闲": 3},
    {"装颜": "紫", "Name": "琴心剑胆", "Sex": "男", "Type": "配饰", "威严": 2, "繁华": 3, "侠客": 4, "武器": 4},
    {"装颜": "紫", "Name": "锦裘青衣", "Sex": "男", "Type": "服饰", "青春": 2, "繁华": 3, "侠客": 4, "风流": 4},
    {"装颜": "紫", "Name": "如意白玉佩", "Sex": "男", "Type": "缀饰", "成熟": 2, "礼服": 2, "威严": 3, "精致": 3},
    {"装颜": "紫", "Name": "青虹", "Sex": "男", "Type": "手持", "黑": 2, "披风": 2, "侠客": 3, "精致": 3},
    //锦绣花苗
    {"装颜": "紫", "Name": "发带", "Sex": "男", "Type": "头饰", "青春": 2, "苗": 4, "武士": 3, "风流": 2},
    {"装颜": "紫", "Name": "海阔山遥", "Sex": "男", "Type": "发型", "青春": 2, "苗": 4, "武士": 3, "风流": 2},
    {"装颜": "紫", "Name": "披风", "Sex": "男", "Type": "配饰", "青春": 2, "苗": 4, "武士": 3, "威严": 2},
    {"装颜": "紫", "Name": "少年意气", "Sex": "男", "Type": "服饰", "青春": 2, "苗": 4, "武士": 3, "威严": 2},
    {"装颜": "紫", "Name": "银锁", "Sex": "男", "Type": "缀饰", "青春": 2, "苗": 4, "舞蹈": 3, "活泼": 2},
    {"装颜": "紫", "Name": "摄魂笛", "Sex": "男", "Type": "手持", "青春": 2, "活泼": 2, "苗": 4, "精致": 2},
    //笑红尘
    {"装颜": "紫", "Name": "清心冠", "Sex": "男", "Type": "头饰", "成熟": 3, "儒雅": 2, "武士": 4, "简约": 3},
    {"装颜": "紫", "Name": "超凡", "Sex": "男", "Type": "发型", "成熟": 3, "清凉": 2, "武士": 4, "简约": 3},
    {"装颜": "紫", "Name": "斗笠", "Sex": "男", "Type": "配饰", "成熟": 3, "威严": 2, "武士": 4, "简约": 3},
    {"装颜": "紫", "Name": "悟道", "Sex": "男", "Type": "服饰", "成熟": 3, "威严": 2, "武士": 4, "精致": 3},
    {"装颜": "紫", "Name": "碎玉", "Sex": "男", "Type": "缀饰", "青春": 3, "风流": 2, "武士": 4, "精致": 3},
    {"装颜": "紫", "Name": "酒葫芦", "Sex": "男", "Type": "手持", "成熟": 3, "风流": 2, "武士": 4, "精致": 3},
    //吴钩霜雪
    {"装颜": "蓝", "Name": "云缕", "Sex": "男", "Type": "头饰", "成熟": 2, "战争": 3, "演戏": 3, "风流": 2},
    {"装颜": "蓝", "Name": "断蓬", "Sex": "男", "Type": "发型", "发髻": 2, "战争": 3, "威严": 2, "刺客": 3},
    {"装颜": "蓝", "Name": "枯桑", "Sex": "男", "Type": "配饰", "成熟": 2, "战争": 2, "侠客": 3, "勇猛": 2},
    {"装颜": "蓝", "Name": "卧秋霜", "Sex": "男", "Type": "服饰", "青春": 2, "战争": 3, "官服": 3, "威严": 2},
    {"装颜": "蓝", "Name": "镜水链", "Sex": "男", "Type": "缀饰", "精致": 2, "战争": 2, "风流": 2, "礼服": 3},
    {"装颜": "蓝", "Name": "金微剑", "Sex": "男", "Type": "手持", "青春": 2, "汉族": 1, "侠客": 3, "白": 3},
    //侠客行
    {"装颜": "蓝", "Name": "塞外月", "Sex": "男", "Type": "头饰", "适温": 2, "古代": 2, "武士": 3, "精致": 3},
    {"装颜": "蓝", "Name": "侠影", "Sex": "男", "Type": "发型", "披发": 2, "繁华": 2, "武士": 3, "勇猛": 3},
    {"装颜": "蓝", "Name": "侠客行", "Sex": "男", "Type": "配饰", "古代": 2, "斗笠": 2, "勇猛": 3, "武士": 2},
    {"装颜": "蓝", "Name": "踏尽天涯", "Sex": "男", "Type": "服饰", "成熟": 2, "适温": 1, "勇猛": 4, "武士": 3},
    {"装颜": "蓝", "Name": "偃月刀", "Sex": "男", "Type": "手持", "武器": 2, "勇猛": 2, "武士": 3, "精致": 3},
    //侠剑江湖
    {"装颜": "青", "Name": "催云带", "Sex": "男", "Type": "头饰", "青春": 2, "简约": 2, "侠客": 3, "勇猛": 2},
    {"装颜": "青", "Name": "风云动", "Sex": "男", "Type": "发型", "青春": 2, "古代": 1, "侠客": 3, "勇猛": 3},
    {"装颜": "青", "Name": "风云肩甲", "Sex": "男", "Type": "配饰", "青春": 2, "威严": 3, "侠客": 3, "精致": 2},
    {"装颜": "青", "Name": "走天涯", "Sex": "男", "Type": "服饰", "青春": 2, "简约": 2, "侠客": 3, "勇猛": 3},
    {"装颜": "青", "Name": "玉壶春", "Sex": "男", "Type": "缀饰", "青春": 1, "活泼": 3, "侠客": 3, "简约": 2},
    {"装颜": "青", "Name": "吞日长刀", "Sex": "男", "Type": "手持", "青春": 2, "威严": 2, "侠客": 3, "精致": 2},
    //暗影
    {"装颜": "灰", "Name": "暗影斗笠", "Sex": "男", "Type": "头饰", "青春": 1, "简约": 2, "勇猛": 2, "刺客": 2},
    {"装颜": "灰", "Name": "幽夜", "Sex": "男", "Type": "发型", "青春": 1, "勇猛": 2, "武士": 2, "精致": 1},
    {"装颜": "灰", "Name": "刺血", "Sex": "男", "Type": "配饰", "精致": 1, "勇猛": 2, "武士": 2, "武器": 2},
    {"装颜": "灰", "Name": "影月舞", "Sex": "男", "Type": "服饰", "青春": 2, "精致": 1, "勇猛": 2, "刺客": 2},
    {"装颜": "灰", "Name": "暗影", "Sex": "男", "Type": "缀饰", "青春": 2, "武士": 2, "勇猛": 2, "精致": 2},
    {"装颜": "灰", "Name": "黑月", "Sex": "男", "Type": "手持", "青春": 2, "舞蹈": 1, "风流": 2, "武士": 1},
    //兑换
    //龙章黄袍
    {"装颜": "橙", "Name": "龙章旒冕", "Sex": "男", "Type": "头饰", "成熟": 3, "冕": 2, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "君德", "Sex": "男", "Type": "发型", "成熟": 2, "官服": 2, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "镇国双鱼符", "Sex": "男", "Type": "配饰", "成熟": 3, "繁华": 3, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "龙章黄袍", "Sex": "男", "Type": "服饰", "成熟": 2, "繁华": 3, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "镇国玉佩", "Sex": "男", "Type": "缀饰", "繁华": 2, "玉佩": 3, "威严": 4, "帝服": 4},
    {"装颜": "橙", "Name": "镇国玉玺", "Sex": "男", "Type": "手持", "成熟": 2, "古代": 2, "威严": 4, "帝服": 4},
    //金丝织锦
    {"装颜": "橙", "Name": "清风冠", "Sex": "男", "Type": "头饰", "成熟": 3, "儒雅": 4, "官服": 4, "精致": 2},
    {"装颜": "橙", "Name": "公卿束发", "Sex": "男", "Type": "发型", "成熟": 3, "简约": 2, "官服": 4, "儒雅": 4},
    {"装颜": "橙", "Name": "且听风吟", "Sex": "男", "Type": "配饰", "成熟": 3, "繁华": 2, "官服": 4, "儒雅": 4},
    {"装颜": "橙", "Name": "两袖清风", "Sex": "男", "Type": "服饰", "成熟": 3, "儒雅": 4, "官服": 4, "保暖": 4},
    {"装颜": "橙", "Name": "清风佩", "Sex": "男", "Type": "缀饰", "成熟": 3, "儒雅": 4, "官服": 4, "精致": 2},
    {"装颜": "橙", "Name": "朝板", "Sex": "男", "Type": "手持", "成熟": 3, "简约": 2, "官服": 4, "儒雅": 4},
    //夏于飞凰
    {"装颜": "橙", "Name": "夏至筵", "Sex": "男", "Type": "头饰", "青春": 4, "适温": 4, "精致": 2, "休闲": 4},
    {"装颜": "橙", "Name": "杨柳青青", "Sex": "男", "Type": "发型", "青春": 3, "白": 2, "披发": 3, "休闲": 2},
    {"装颜": "橙", "Name": "散微涡", "Sex": "男", "Type": "配饰", "蓝": 2, "古代": 3, "儒雅": 5, "休闲": 4},
    {"装颜": "橙", "Name": "夜来雨", "Sex": "男", "Type": "服饰", "蓝": 4, "儒雅": 3, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "清晨迟", "Sex": "男", "Type": "缀饰", "蓝": 4, "长命锁": 2, "青春": 3, "休闲": 4},
    {"装颜": "橙", "Name": "聚亭影", "Sex": "男", "Type": "手持", "青春": 5, "蓝": 3, "汉族": 2, "休闲": 4},
    //魅惑之面
    {"装颜": "橙", "Name": "花开几许", "Sex": "男", "Type": "头饰", "成熟": 5, "紫": 3, "舞蹈": 4, "清凉": 3},
    {"装颜": "橙", "Name": "群芳", "Sex": "男", "Type": "发型", "古代": 2, "清凉": 3, "舞蹈": 4, "繁华": 3},
    {"装颜": "橙", "Name": "魅惑之面", "Sex": "男", "Type": "配饰", "波斯": 3, "清凉": 4, "舞蹈": 4, "风流": 3},
    {"装颜": "橙", "Name": "一帘风月", "Sex": "男", "Type": "服饰", "古代": 2, "清凉": 5, "舞蹈": 5, "紫": 3},
    {"装颜": "橙", "Name": "垂泪", "Sex": "男", "Type": "缀饰", "成熟": 3, "清凉": 4, "舞蹈": 4, "繁华": 3},
    {"装颜": "橙", "Name": "夜阑珊", "Sex": "男", "Type": "手持", "波斯": 3, "古代": 3, "舞蹈": 4, "繁华": 4},
    //公卿紫袍
    {"装颜": "紫", "Name": "公卿束冠", "Sex": "男", "Type": "头饰", "威严": 4, "繁华": 3, "官服": 4, "礼服": 2},
    {"装颜": "紫", "Name": "雍雍公卿", "Sex": "男", "Type": "发型", "成熟": 2, "威严": 4, "官服": 4, "礼服": 2},
    {"装颜": "紫", "Name": "金鱼符", "Sex": "男", "Type": "配饰", "威严": 4, "冷色调": 2, "官服": 4, "精致": 2},
    {"装颜": "紫", "Name": "公卿紫袍", "Sex": "男", "Type": "服饰", "繁华": 2, "威严": 4, "官服": 4, "礼服": 2},
    {"装颜": "紫", "Name": "公卿禁步", "Sex": "男", "Type": "缀饰", "成熟": 2, "威严": 4, "官服": 4, "精致": 2},
    {"装颜": "紫", "Name": "玉笏板", "Sex": "男", "Type": "手持", "礼服": 2, "威严": 4, "官服": 4, "精致": 2},
    //进贤绛服
    {"装颜": "紫", "Name": "进贤冠", "Sex": "男", "Type": "头饰", "精致": 2, "官服": 2, "威严": 4, "礼服": 4},
    {"装颜": "紫", "Name": "见贤思齐", "Sex": "男", "Type": "发型", "精致": 2, "官服": 2, "威严": 4, "礼服": 4},
    {"装颜": "紫", "Name": "近贤则明", "Sex": "男", "Type": "配饰", "官服": 2, "精致": 2, "威严": 4, "礼服": 4},
    {"装颜": "紫", "Name": "进贤绛服", "Sex": "男", "Type": "服饰", "红": 2, "官服": 2, "威严": 3, "礼服": 4},
    {"装颜": "紫", "Name": "进贤平安扣", "Sex": "男", "Type": "缀饰", "精致": 3, "暖色调": 2, "威严": 2, "礼服": 4},
    {"装颜": "紫", "Name": "进贤笏板", "Sex": "男", "Type": "手持", "成熟": 2, "精致": 4, "威严": 2, "礼服": 4},
    //猫妖
    {"装颜": "紫", "Name": "猫耳", "Sex": "男", "Type": "头饰", "成熟": 2, "头带": 2, "古代": 3, "鬼": 4},
    {"装颜": "紫", "Name": "银丝", "Sex": "男", "Type": "发型", "古代": 2, "鬼": 4, "披发": 3, "精致": 4},
    {"装颜": "紫", "Name": "绮梦", "Sex": "男", "Type": "配饰", "汉族": 3, "成熟": 2, "风流": 3, "鬼": 4},
    {"装颜": "紫", "Name": "妖魇", "Sex": "男", "Type": "服饰", "汉族": 2, "成熟": 2, "风流": 3, "鬼": 4},
    {"装颜": "紫", "Name": "顶圈", "Sex": "男", "Type": "缀饰", "成熟": 4, "适温": 2, "古代": 3, "鬼": 4},
    {"装颜": "紫", "Name": "猫爪手", "Sex": "男", "Type": "手持", "风流": 2, "武器": 3, "古代": 3, "鬼": 4},
    //朝云
    {"装颜": "紫", "Name": "雀翎冠", "Sex": "男", "Type": "头饰", "成熟": 2, "文人": 3, "官服": 4, "儒雅": 2},
    {"装颜": "紫", "Name": "暮隐", "Sex": "男", "Type": "发型", "风流": 2, "清凉": 2, "武士": 4, "古代": 2},
    {"装颜": "紫", "Name": "采贤带", "Sex": "男", "Type": "配饰", "青春": 2, "飘带": 2, "风流": 4, "礼服": 2},
    {"装颜": "紫", "Name": "夜阑风雨", "Sex": "男", "Type": "服饰", "青春": 2, "文人": 3, "官服": 4, "儒雅": 2},
    {"装颜": "紫", "Name": "东篱禁步", "Sex": "男", "Type": "缀饰", "青春": 2, "礼服": 2, "儒雅": 4, "玉佩": 2},
    {"装颜": "紫", "Name": "翰墨", "Sex": "男", "Type": "手持", "书籍": 4, "文人": 3, "儒雅": 2, "简约": 1},
    //化蝶
    {"装颜": "紫", "Name": "琉璃冠", "Sex": "男", "Type": "头饰", "黄": 3, "冠": 2, "舞蹈": 4, "精致": 3},
    {"装颜": "紫", "Name": "三千丝", "Sex": "男", "Type": "发型", "古代": 2, "短发": 4, "舞蹈": 4, "精致": 3},
    {"装颜": "紫", "Name": "蝶舞", "Sex": "男", "Type": "配饰", "青春": 3, "动物": 2, "舞蹈": 4, "蓝": 3},
    {"装颜": "紫", "Name": "蝶恋花", "Sex": "男", "Type": "服饰", "舞蹈": 4, "清凉": 2, "风流": 4, "精致": 3},
    {"装颜": "紫", "Name": "冰雨", "Sex": "男", "Type": "缀饰", "汉族": 3, "蓝": 2, "舞蹈": 4, "古代": 3},
    {"装颜": "紫", "Name": "帘卷西风", "Sex": "男", "Type": "手持", "青春": 3, "蓝": 2, "舞蹈": 4, "古代": 3},
    //使君绯杉
    {"装颜": "蓝", "Name": "使君乔木冠", "Sex": "男", "Type": "头饰", "礼服": 2, "官服": 2, "威严": 3, "精致": 3},
    {"装颜": "蓝", "Name": "卓卓使君", "Sex": "男", "Type": "发型", "适温": 2, "古代": 3, "威严": 3, "官服": 3},
    {"装颜": "蓝", "Name": "银鱼符", "Sex": "男", "Type": "配饰", "成熟": 2, "官服": 2, "儒雅": 3, "礼服": 2},
    {"装颜": "蓝", "Name": "使君绯杉", "Sex": "男", "Type": "服饰", "成熟": 2, "官服": 2, "威严": 3, "礼服": 2},
    {"装颜": "蓝", "Name": "使君玉璜", "Sex": "男", "Type": "缀饰", "成熟": 2, "精致": 2, "儒雅": 3, "礼服": 2},
    {"装颜": "蓝", "Name": "象牙笏板", "Sex": "男", "Type": "手持", "威严": 3, "笏": 2, "官服": 3, "礼服": 2},
    //素纹青衫
    {"装颜": "青", "Name": "青衫束冠", "Sex": "男", "Type": "头饰", "成熟": 2, "礼服": 2, "儒雅": 3, "精致": 2},
    {"装颜": "青", "Name": "谦谦君子", "Sex": "男", "Type": "发型", "成熟": 1, "文人": 1, "儒雅": 3, "休闲": 2},
    {"装颜": "青", "Name": "铜鱼符", "Sex": "男", "Type": "配饰", "成熟": 2, "适温": 1, "儒雅": 3, "官服": 2},
    {"装颜": "青", "Name": "素纹青衫", "Sex": "男", "Type": "服饰", "成熟": 2, "官服": 2, "儒雅": 3, "礼服": 2},
    {"装颜": "青", "Name": "青衫环佩", "Sex": "男", "Type": "缀饰", "成熟": 2, "礼服": 2, "儒雅": 3, "精致": 2},
    {"装颜": "青", "Name": "竹木笏板", "Sex": "男", "Type": "手持", "简约": 1, "儒雅": 3, "官服": 3, "礼服": 2},
    //商城
    //花非花
    {"装颜": "橙", "Name": "莲华冠", "Sex": "男", "Type": "头饰", "儒雅": 3, "神仙": 2, "繁华": 4, "礼服": 4},
    {"装颜": "橙", "Name": "禅心", "Sex": "男", "Type": "发型", "成熟": 3, "神仙": 4, "简约": 2, "威严": 2},
    {"装颜": "橙", "Name": "平安扣", "Sex": "男", "Type": "配饰", "古代": 3, "神仙": 3, "简约": 4, "风流": 4},
    {"装颜": "橙", "Name": "蓝莲袍", "Sex": "男", "Type": "服饰", "风流": 3, "神仙": 2, "繁华": 4, "礼服": 4},
    {"装颜": "橙", "Name": "莲花吊坠", "Sex": "男", "Type": "缀饰", "儒雅": 4, "神仙": 3, "繁华": 4, "礼服": 2},
    {"装颜": "橙", "Name": "佛珠", "Sex": "男", "Type": "手持", "古代": 3, "神仙": 3, "简约": 4, "风流": 4},
    //花满天
    {"装颜": "橙", "Name": "沉香落鱼", "Sex": "男", "Type": "头饰", "适温": 4, "儒雅": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "恰似落水", "Sex": "男", "Type": "发型", "成熟": 2, "儒雅": 3, "古代": 5, "休闲": 4},
    {"装颜": "橙", "Name": "小鸟依人", "Sex": "男", "Type": "配饰", "成熟": 5, "适温": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "橙", "Name": "金银坠", "Sex": "男", "Type": "服饰", "成熟": 4, "锦缎": 3, "青": 3, "休闲": 4},
    {"装颜": "橙", "Name": "楠甜美衫", "Sex": "男", "Type": "缀饰", "汉族": 3, "青": 3, "适温": 2, "休闲": 4},
    {"装颜": "橙", "Name": "天舞轮", "Sex": "男", "Type": "手持", "成熟": 5, "适温": 2, "儒雅": 3, "休闲": 4},
    //梧桐疏雨
    {"装颜": "紫", "Name": "梦寒冠", "Sex": "男", "Type": "头饰", "成熟": 2, "儒雅": 3, "官服": 4, "礼服": 2},
    {"装颜": "紫", "Name": "烟水寒", "Sex": "男", "Type": "发型", "精致": 2, "文人": 4, "风流": 3, "休闲": 2},
    {"装颜": "紫", "Name": "皓雪", "Sex": "男", "Type": "配饰", "成熟": 2, "文人": 4, "儒雅": 3, "休闲": 2},
    {"装颜": "紫", "Name": "寒烟醉", "Sex": "男", "Type": "服饰", "成熟": 2, "文人": 4, "儒雅": 3, "休闲": 2},
    {"装颜": "紫", "Name": "秋思", "Sex": "男", "Type": "缀饰", "成熟": 2, "休闲": 2, "儒雅": 3, "礼服": 4},
    {"装颜": "紫", "Name": "玉楼扇", "Sex": "男", "Type": "手持", "成熟": 2, "文人": 4, "儒雅": 3, "休闲": 2},
    //有匪君子
    {"装颜": "紫", "Name": "君子荷叶巾", "Sex": "男", "Type": "头饰", "简约": 2, "休闲": 3, "儒雅": 3, "礼服": 3},
    {"装颜": "紫", "Name": "翩翩君子", "Sex": "男", "Type": "发型", "青春": 2, "精致": 2, "儒雅": 2, "休闲": 3},
    {"装颜": "紫", "Name": "碧海潮生萧", "Sex": "男", "Type": "配饰", "休闲": 2, "文人": 2, "风流": 4, "乐器": 4},
    {"装颜": "紫", "Name": "君子书生服", "Sex": "男", "Type": "服饰", "青春": 2, "文人": 2, "风流": 4, "休闲": 2},
    {"装颜": "紫", "Name": "君子平安扣", "Sex": "男", "Type": "缀饰", "休闲": 3, "礼服": 3, "风流": 2, "精致": 3},
    {"装颜": "紫", "Name": "君子书篓", "Sex": "男", "Type": "手持", "成熟": 2, "文人": 4, "儒雅": 3, "简约": 3},
    //桃之夭夭
    {"装颜": "紫", "Name": "春日游", "Sex": "男", "Type": "头饰", "适温": 2, "古代": 2, "红": 2, "休闲": 4},
    {"装颜": "紫", "Name": "情思", "Sex": "男", "Type": "发型", "汉族": 2, "活泼": 3, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "落花飞舞", "Sex": "男", "Type": "配饰", "汉族": 2, "活泼": 2, "适温": 2, "休闲": 4},
    {"装颜": "紫", "Name": "桃之夭夭", "Sex": "男", "Type": "服饰", "青春": 2, "活泼": 3, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "灼灼其华", "Sex": "男", "Type": "缀饰", "青春": 2, "活泼": 4, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "花开一季", "Sex": "男", "Type": "手持", "适温": 3, "青春": 3, "乐器": 2, "休闲": 4},
    //云容花想
    {"装颜": "紫", "Name": "凉梦", "Sex": "男", "Type": "头饰", "童真": 2, "活泼": 3, "简约": 2, "休闲": 4},
    {"装颜": "紫", "Name": "清和风", "Sex": "男", "Type": "发型", "童真": 2, "活泼": 3, "侠客": 4, "简约": 2},
    {"装颜": "紫", "Name": "映水", "Sex": "男", "Type": "配饰", "勇猛": 2, "保暖": 3, "侠客": 4, "披风": 3},
    {"装颜": "紫", "Name": "惜余欢", "Sex": "男", "Type": "服饰", "青春": 2, "精致": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "华胥佩", "Sex": "男", "Type": "缀饰", "精致": 3, "文人": 4, "儒雅": 3, "礼服": 3},
    {"装颜": "紫", "Name": "清音醉", "Sex": "男", "Type": "手持", "演戏": 3, "风流": 3, "舞蹈": 4, "乐器": 3},
    //水云间
    {"装颜": "紫", "Name": "回雪", "Sex": "男", "Type": "头饰", "蓝": 2, "古代": 2, "儒雅": 4, "休闲": 4},
    {"装颜": "紫", "Name": "流风", "Sex": "男", "Type": "发型", "古代": 2, "文人": 3, "儒雅": 4, "休闲": 3},
    {"装颜": "紫", "Name": "雾绡", "Sex": "男", "Type": "配饰", "青春": 2, "古代": 2, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "云水谣", "Sex": "男", "Type": "服饰", "蓝": 2, "清凉": 2, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "水潺潺", "Sex": "男", "Type": "缀饰", "青春": 2, "简约": 2, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "清波扇", "Sex": "男", "Type": "手持", "蓝": 2, "清凉": 4, "风流": 4, "文人": 2},
    //春风夜雨
    {"装颜": "紫", "Name": "尘香", "Sex": "男", "Type": "头饰", "青春": 3, "休闲": 2, "儒雅": 4, "精致": 3},
    {"装颜": "紫", "Name": "春归", "Sex": "男", "Type": "发型", "青春": 3, "休闲": 2, "风流": 4, "精致": 3},
    {"装颜": "紫", "Name": "东风过", "Sex": "男", "Type": "配饰", "休闲": 2, "礼服": 2, "风流": 4, "精致": 3},
    {"装颜": "紫", "Name": "春风十里", "Sex": "男", "Type": "服饰", "青春": 2, "礼服": 3, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "照影佩", "Sex": "男", "Type": "缀饰", "休闲": 2, "礼服": 2, "风流": 4, "精致": 3},
    {"装颜": "紫", "Name": "听落笛", "Sex": "男", "Type": "手持", "休闲": 2, "礼服": 2, "风流": 4, "精致": 3},
    //轻罗一梦
    {"装颜": "紫", "Name": "玉惊冠", "Sex": "男", "Type": "头饰", "青春": 2, "精致": 3, "儒雅": 2, "礼服": 4},
    {"装颜": "紫", "Name": "疏影", "Sex": "男", "Type": "发型", "青春": 3, "休闲": 2, "儒雅": 4, "礼服": 3},
    {"装颜": "紫", "Name": "轻罗", "Sex": "男", "Type": "配饰", "青春": 2, "休闲": 2, "儒雅": 4, "礼服": 3},
    {"装颜": "紫", "Name": "凌苍袍", "Sex": "男", "Type": "服饰", "青春": 2, "精致": 3, "休闲": 3, "礼服": 4},
    {"装颜": "紫", "Name": "弦歌", "Sex": "男", "Type": "缀饰", "青春": 4, "休闲": 3, "儒雅": 2, "礼服": 3},
    {"装颜": "紫", "Name": "关睢", "Sex": "男", "Type": "手持", "青春": 3, "休闲": 2, "书籍": 2, "礼服": 4},
    //暗香浮动
    {"装颜": "紫", "Name": "翠华冠", "Sex": "男", "Type": "头饰", "青春": 2, "文人": 3, "儒雅": 4, "休闲": 3},
    {"装颜": "紫", "Name": "风轻舞", "Sex": "男", "Type": "发型", "青春": 2, "简约": 2, "风流": 4, "侠客": 3},
    {"装颜": "紫", "Name": "绿意", "Sex": "男", "Type": "配饰", "披风": 2, "侠客": 3, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "青丝罗衫", "Sex": "男", "Type": "服饰", "青春": 2, "文人": 3, "风流": 4, "休闲": 3},
    {"装颜": "紫", "Name": "绿丝绦", "Sex": "男", "Type": "缀饰", "青春": 2, "文人": 3, "儒雅": 4, "休闲": 3},
    {"装颜": "紫", "Name": "流光壶", "Sex": "男", "Type": "手持", "酒壶": 2, "侠客": 3, "风流": 4, "休闲": 3},
    //望仙
    {"装颜": "紫", "Name": "虚怀", "Sex": "男", "Type": "头饰", "青春": 2, "神仙": 2, "儒雅": 2, "礼服": 4},
    {"装颜": "紫", "Name": "云缥缈", "Sex": "男", "Type": "发型", "儒雅": 2, "神仙": 4, "简约": 3, "礼服": 2},
    {"装颜": "紫", "Name": "鹤然", "Sex": "男", "Type": "配饰", "简约": 2, "神仙": 2, "儒雅": 4, "礼服": 3},
    {"装颜": "紫", "Name": "兮生烟", "Sex": "男", "Type": "服饰", "古代": 2, "神仙": 2, "儒雅": 4, "礼服": 3},
    {"装颜": "紫", "Name": "吟泉", "Sex": "男", "Type": "缀饰", "精致": 2, "神仙": 2, "儒雅": 3, "礼服": 4},
    {"装颜": "紫", "Name": "引魂灯", "Sex": "男", "Type": "手持", "青春": 2, "礼服": 3, "儒雅": 2, "精致": 4},
    //锁清秋
    {"装颜": "紫", "Name": "秋露微", "Sex": "男", "Type": "头饰", "青春": 2, "精致": 2, "风流": 3, "休闲": 4},
    {"装颜": "紫", "Name": "落木萧萧", "Sex": "男", "Type": "发型", "风流": 2, "简约": 3, "保暖": 4, "礼服": 3},
    {"装颜": "紫", "Name": "秋霜佩", "Sex": "男", "Type": "配饰", "青春": 2, "精致": 2, "儒雅": 3, "礼服": 4},
    {"装颜": "紫", "Name": "秋色梧桐", "Sex": "男", "Type": "服饰", "青春": 2, "精致": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "秋色连波", "Sex": "男", "Type": "缀饰", "宴会": 4, "繁华": 2, "风流": 3, "青春": 2},
    {"装颜": "紫", "Name": "玉笙笔", "Sex": "男", "Type": "手持", "青春": 2, "文人": 4, "儒雅": 3, "精致": 2},
    //闲看庭花
    {"装颜": "蓝", "Name": "笑春风", "Sex": "男", "Type": "头饰", "简约": 2, "运动": 3, "侠客": 3, "勇猛": 2},
    {"装颜": "蓝", "Name": "少年游", "Sex": "男", "Type": "发型", "简约": 2, "运动": 3, "侠客": 3, "活泼": 2},
    {"装颜": "蓝", "Name": "墨染披风", "Sex": "男", "Type": "配饰", "青春": 2, "运动": 3, "侠客": 3, "勇猛": 2},
    {"装颜": "蓝", "Name": "孤鸿影", "Sex": "男", "Type": "服饰", "勇猛": 2, "运动": 3, "侠客": 3, "精致": 2},
    {"装颜": "蓝", "Name": "朔金带", "Sex": "男", "Type": "缀饰", "勇猛": 2, "运动": 3, "侠客": 3, "精致": 2},
    {"装颜": "蓝", "Name": "桃木杯", "Sex": "男", "Type": "手持", "酒杯": 3, "黄": 1, "风流": 2, "精致": 3},
    //春归
    {"装颜": "蓝", "Name": "翠意", "Sex": "男", "Type": "头饰", "青春": 2, "风流": 2, "舞蹈": 2, "休闲": 2},
    {"装颜": "蓝", "Name": "绿杨阴", "Sex": "男", "Type": "发型", "舞蹈": 2, "简约": 2, "风流": 3, "休闲": 3},
    {"装颜": "蓝", "Name": "雀啼", "Sex": "男", "Type": "配饰", "青春": 3, "活泼": 3, "动物": 2, "休闲": 3},
    {"装颜": "蓝", "Name": "柳烟轻", "Sex": "男", "Type": "服饰", "舞蹈": 2, "精致": 2, "风流": 3, "休闲": 2},
    {"装颜": "蓝", "Name": "清波", "Sex": "男", "Type": "缀饰", "青春": 3, "休闲": 2, "儒雅": 2, "精致": 2},
    {"装颜": "蓝", "Name": "折柳", "Sex": "男", "Type": "手持", "青春": 3, "休闲": 2, "风流": 3, "乐器": 2},
    //夏服
    {"装颜": "蓝", "Name": "国香为冠", "Sex": "男", "Type": "头饰", "风流": 2, "古代": 2, "简约": 2, "休闲": 3},
    {"装颜": "蓝", "Name": "兰芷馥馥", "Sex": "男", "Type": "发型", "青春": 2, "简约": 2, "风流": 3, "休闲": 3},
    {"装颜": "蓝", "Name": "馥郁兰芷", "Sex": "男", "Type": "配饰", "青春": 3, "风流": 2, "简约": 2, "休闲": 3},
    {"装颜": "蓝", "Name": "兰丁佩芷", "Sex": "男", "Type": "服饰", "青春": 2, "古代": 2, "风流": 3, "休闲": 3},
    {"装颜": "蓝", "Name": "宛于水心", "Sex": "男", "Type": "缀饰", "青春": 2, "简约": 2, "风流": 3, "休闲": 3},
    {"装颜": "蓝", "Name": "兰芷佳酿", "Sex": "男", "Type": "手持", "青春": 2, "简约": 2, "风流": 3, "休闲": 3},
    //闲乘月
    {"装颜": "蓝", "Name": "青竹", "Sex": "男", "Type": "头饰", "青春": 2, "古代": 2, "风流": 3, "休闲": 2},
    {"装颜": "蓝", "Name": "旧梦", "Sex": "男", "Type": "发型", "青春": 2, "活泼": 3, "简约": 2, "休闲": 1},
    {"装颜": "蓝", "Name": "银绮", "Sex": "男", "Type": "配饰", "抹额": 2, "简约": 2, "风流": 3, "礼服": 3},
    {"装颜": "蓝", "Name": "山烟欲收", "Sex": "男", "Type": "服饰", "丧服": 3, "锦缎": 2, "儒雅": 2, "青": 1},
    {"装颜": "蓝", "Name": "绿芜佩", "Sex": "男", "Type": "缀饰", "成熟": 3, "礼佛": 2, "繁华": 3, "汉族": 2},
    {"装颜": "蓝", "Name": "丹青卷", "Sex": "男", "Type": "手持", "成熟": 2, "文人": 3, "儒雅": 3, "简约": 2},
    //闲云潭影
    {"装颜": "青", "Name": "寒烟翠", "Sex": "男", "Type": "头饰", "精致": 2, "礼服": 2, "儒雅": 3, "休闲": 2},
    {"装颜": "青", "Name": "秋梧", "Sex": "男", "Type": "发型", "精致": 2, "官服": 2, "儒雅": 3, "休闲": 2},
    {"装颜": "青", "Name": "枫落带", "Sex": "男", "Type": "配饰", "青春": 1, "精致": 1, "风流": 2, "礼服": 3},
    {"装颜": "青", "Name": "清辉碧海", "Sex": "男", "Type": "服饰", "风流": 2, "休闲": 2, "舞蹈": 2, "精致": 3},
    {"装颜": "青", "Name": "苍翠", "Sex": "男", "Type": "缀饰", "青春": 2, "精致": 2, "儒雅": 3, "休闲": 2},
    {"装颜": "青", "Name": "莲花引", "Sex": "男", "Type": "手持", "青春": 2, "简约": 2, "风流": 3, "休闲": 2},
    //稚子垂髫
    {"装颜": "青", "Name": "韶年发带", "Sex": "男", "Type": "头饰", "童真": 3, "活泼": 2, "古代": 3, "休闲": 2},
    {"装颜": "青", "Name": "稚子束发", "Sex": "男", "Type": "发型", "童真": 3, "活泼": 2, "汉族": 3, "休闲": 2},
    {"装颜": "青", "Name": "背篓", "Sex": "男", "Type": "配饰", "童真": 1, "背篓": 3, "古代": 3, "简约": 1},
    {"装颜": "青", "Name": "杏花春雨", "Sex": "男", "Type": "服饰", "童真": 3, "活泼": 2, "汉族": 1, "休闲": 2},
    {"装颜": "青", "Name": "长命锁", "Sex": "男", "Type": "缀饰", "礼佛": 3, "长命锁": 2, "童真": 1, "休闲": 2},
    {"装颜": "青", "Name": "蹴鞠", "Sex": "男", "Type": "手持", "童真": 2, "蹴鞠": 3, "活泼": 2, "休闲": 1},
    //陌上少年
    {"装颜": "青", "Name": "兰田长簪", "Sex": "男", "Type": "头饰", "青春": 2, "礼服": 2, "儒雅": 1, "休闲": 2},
    {"装颜": "青", "Name": "少年行", "Sex": "男", "Type": "发型", "青春": 2, "简约": 2, "儒雅": 2, "休闲": 2},
    {"装颜": "青", "Name": "蝶恋花", "Sex": "男", "Type": "配饰", "动物": 2, "活泼": 3, "青春": 2, "休闲": 3},
    {"装颜": "青", "Name": "陌上少年", "Sex": "男", "Type": "服饰", "青春": 2, "简约": 2, "儒雅": 2, "休闲": 2},
    {"装颜": "青", "Name": "缓缓香囊", "Sex": "男", "Type": "缀饰", "青春": 2, "儒雅": 2, "舞蹈": 2, "精致": 2},
    {"装颜": "青", "Name": "桃花枝", "Sex": "男", "Type": "手持", "青春": 2, "精致": 2, "舞蹈": 2, "休闲": 2},
    //豆蔻年华
    {"装颜": "青", "Name": "凌云冠", "Sex": "男", "Type": "头饰", "青春": 2, "官服": 2, "儒雅": 3, "礼服": 2},
    {"装颜": "青", "Name": "枫叶丹", "Sex": "男", "Type": "发型", "青春": 2, "束发": 1, "风流": 3, "休闲": 2},
    {"装颜": "青", "Name": "暮雨", "Sex": "男", "Type": "配饰", "精致": 1, "儒雅": 2, "官服": 2, "礼服": 3},
    {"装颜": "青", "Name": "红罗袍", "Sex": "男", "Type": "服饰", "成熟": 2, "官服": 2, "儒雅": 2, "礼服": 3},
    {"装颜": "青", "Name": "燕青坠", "Sex": "男", "Type": "缀饰", "童真": 2, "活泼": 3, "精致": 1, "休闲": 2},
    {"装颜": "青", "Name": "墨玉笔", "Sex": "男", "Type": "手持", "简约": 1, "文人": 3, "儒雅": 2, "笔": 2},
    //珍稀
    //醉花阴
    {"装颜": "红", "Name": "玉枕凉", "Sex": "男", "Type": "头饰", "成熟": 4, "黄": 3, "风流": 2, "礼服": 5},
    {"装颜": "红", "Name": "黄昏后", "Sex": "男", "Type": "发型", "黑": 2, "精致": 4, "古代": 3, "礼服": 5},
    {"装颜": "红", "Name": "暗香盈袖", "Sex": "男", "Type": "配饰", "汉族": 4, "适温": 4, "成熟": 3, "礼服": 5},
    {"装颜": "红", "Name": "醉花阴", "Sex": "男", "Type": "服饰", "成熟": 3, "锦缎": 3, "古代": 4, "礼服": 5},
    {"装颜": "红", "Name": "帘卷西风", "Sex": "男", "Type": "缀饰", "成熟": 3, "腰饰": 3, "古代": 4, "礼服": 5},
    {"装颜": "红", "Name": "把酒东篱", "Sex": "男", "Type": "手持", "成熟": 3, "武器": 2, "古代": 4, "礼服": 5},
    //缘定三生
    {"装颜": "橙", "Name": "高清云渺", "Sex": "男", "Type": "头饰", "成熟": 2, "神仙": 4, "繁华": 4, "风流": 4},
    {"装颜": "橙", "Name": "银烛冷秋", "Sex": "男", "Type": "发型", "汉族": 3, "神仙": 4, "风流": 4, "清凉": 3},
    {"装颜": "橙", "Name": "相逢一醉", "Sex": "男", "Type": "配饰", "古代": 2, "神仙": 4, "繁华": 4, "清凉": 4},
    {"装颜": "橙", "Name": "缘定三生", "Sex": "男", "Type": "服饰", "黑": 3, "神仙": 4, "古代": 2, "清凉": 5},
    {"装颜": "橙", "Name": "天风海雨", "Sex": "男", "Type": "缀饰", "黑": 3, "神仙": 4, "古代": 2, "清凉": 5},
    {"装颜": "橙", "Name": "飘然何处", "Sex": "男", "Type": "手持", "成熟": 3, "神仙": 4, "风流": 3, "清凉": 3},
    //紫陌垂杨
    {"装颜": "橙", "Name": "斗芳菲", "Sex": "男", "Type": "头饰", "成熟": 4, "冠": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "祝东风", "Sex": "男", "Type": "发型", "成熟": 4, "束发": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "绣羽衔花", "Sex": "男", "Type": "配饰", "成熟": 4, "适温": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "紫陌垂杨", "Sex": "男", "Type": "服饰", "适温": 4, "汉族": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "湖色春光", "Sex": "男", "Type": "缀饰", "适温": 3, "汉族": 2, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "游遍芳丛", "Sex": "男", "Type": "手持", "适温": 2, "灯": 2, "古代": 3, "休闲": 4},
    //感恩节
    {"装颜": "橙", "Name": "多闲情", "Sex": "男", "Type": "头饰", "黄": 3, "精致": 2, "成熟": 2, "休闲": 4},
    {"装颜": "橙", "Name": "吟春亭", "Sex": "男", "Type": "发型", "精致": 2, "发髻": 3, "儒雅": 2, "休闲": 4},
    {"装颜": "橙", "Name": "歌倾城", "Sex": "男", "Type": "配饰", "适温": 3, "成熟": 3, "儒雅": 3, "休闲": 4},
    {"装颜": "橙", "Name": "愁娉婷", "Sex": "男", "Type": "服饰", "汉族": 4, "适温": 3, "古代": 3, "休闲": 4},
    {"装颜": "橙", "Name": "留轻盈", "Sex": "男", "Type": "缀饰", "适温": 3, "成熟": 3, "儒雅": 3, "休闲": 4},
    {"装颜": "橙", "Name": "惭清明", "Sex": "男", "Type": "手持", "适温": 3, "成熟": 3, "儒雅": 3, "休闲": 4},
    //缤纷圣诞
    {"装颜": "橙", "Name": "圣诞麋鹿", "Sex": "男", "Type": "头饰", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "飘雪之夜", "Sex": "男", "Type": "发型", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "圣诞颂歌", "Sex": "男", "Type": "配饰", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "缤纷圣诞", "Sex": "男", "Type": "服饰", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "霓虹璀璨", "Sex": "男", "Type": "缀饰", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "祝福之诗", "Sex": "男", "Type": "手持", "青春": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    //锦绣繁花
    {"装颜": "橙", "Name": "垂金缕", "Sex": "男", "Type": "头饰", "成熟": 3, "繁华": 2, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "试新妆", "Sex": "男", "Type": "发型", "适温": 2, "发髻": 2, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "东风静", "Sex": "男", "Type": "配饰", "成熟": 4, "繁华": 3, "风流": 5, "礼服": 5},
    {"装颜": "橙", "Name": "锦绣繁花", "Sex": "男", "Type": "服饰", "成熟": 3, "繁华": 2, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "半含朝雨", "Sex": "男", "Type": "缀饰", "成熟": 3, "繁华": 2, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "岁华到", "Sex": "男", "Type": "手持", "成熟": 3, "繁华": 2, "风流": 4, "礼服": 4},
    //寒江雪
    {"装颜": "橙", "Name": "欲雪冠", "Sex": "男", "Type": "头饰", "青春": 2, "精致": 3, "风流": 4, "礼服": 3},
    {"装颜": "橙", "Name": "墨痕", "Sex": "男", "Type": "发型", "简约": 2, "风流": 3, "侠客": 4, "休闲": 3},
    {"装颜": "橙", "Name": "雁雪", "Sex": "男", "Type": "配饰", "成熟": 3, "繁华": 4, "保暖": 4, "风流": 4},
    {"装颜": "橙", "Name": "浮图梦", "Sex": "男", "Type": "服饰", "青春": 2, "简约": 3, "风流": 4, "休闲": 3},
    {"装颜": "橙", "Name": "洗砚佩", "Sex": "男", "Type": "缀饰", "精致": 3, "文人": 3, "儒雅": 4, "礼服": 3},
    {"装颜": "橙", "Name": "夜光盏", "Sex": "男", "Type": "手持", "宴会": 4, "文人": 3, "风流": 3, "精致": 3},
    //舞动五月
    {"装颜": "橙", "Name": "烟柳", "Sex": "男", "Type": "头饰", "青春": 3, "休闲": 4, "古代": 2, "精致": 5},
    {"装颜": "橙", "Name": "荫浓", "Sex": "男", "Type": "发型", "青春": 3, "精致": 4, "束发": 3, "休闲": 4},
    {"装颜": "橙", "Name": "翠幕烟绡", "Sex": "男", "Type": "配饰", "青春": 3, "绿": 4, "适温": 3, "休闲": 4},
    {"装颜": "橙", "Name": "舞动五月", "Sex": "男", "Type": "服饰", "青春": 3, "绿": 3, "汉族": 3, "休闲": 4},
    {"装颜": "橙", "Name": "秋烟微", "Sex": "男", "Type": "缀饰", "适温": 3, "休闲": 4, "儒雅": 3, "精致": 4},
    {"装颜": "橙", "Name": "清游未还", "Sex": "男", "Type": "手持", "青春": 4, "绿": 2, "儒雅": 3, "休闲": 4},
    //风和雨柔
    {"装颜": "橙", "Name": "开玉合", "Sex": "男", "Type": "头饰", "成熟": 3, "紫": 3, "汉族": 3, "休闲": 4},
    {"装颜": "橙", "Name": "洗纤素", "Sex": "男", "Type": "发型", "成熟": 2, "古代": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "橙", "Name": "燕弄梭", "Sex": "男", "Type": "配饰", "成熟": 3, "绿": 2, "繁华": 3, "休闲": 4},
    {"装颜": "橙", "Name": "风和雨柔", "Sex": "男", "Type": "服饰", "成熟": 3, "紫": 3, "汉族": 3, "休闲": 4},
    {"装颜": "橙", "Name": "露华温", "Sex": "男", "Type": "缀饰", "适温": 3, "儒雅": 2, "繁华": 3, "休闲": 4},
    {"装颜": "橙", "Name": "月魄寒", "Sex": "男", "Type": "手持", "适温": 2, "绿": 4, "伞": 3, "休闲": 4},
    //倩女幽魂
    {"装颜": "橙", "Name": "玉簪暗暗", "Sex": "男", "Type": "头饰", "汉族": 4, "发髻": 2, "精致": 2, "道士": 4},
    {"装颜": "橙", "Name": "寸寸青丝", "Sex": "男", "Type": "发型", "汉族": 4, "发髻": 2, "精致": 2, "道士": 4},
    {"装颜": "橙", "Name": "今生无悔", "Sex": "男", "Type": "配饰", "成熟": 3, "精致": 3, "威严": 4, "道士": 4},
    {"装颜": "橙", "Name": "倩女幽魂", "Sex": "男", "Type": "服饰", "汉族": 2, "锦缎": 3, "精致": 2, "道士": 4},
    {"装颜": "橙", "Name": "十里平湖", "Sex": "男", "Type": "缀饰", "汉族": 3, "清凉": 3, "锦缎": 3, "道士": 4},
    {"装颜": "橙", "Name": "只羡鸳鸯", "Sex": "男", "Type": "手持", "汉族": 3, "武器": 3, "黄": 2, "道士": 4},
    //千里婵娟
    {"装颜": "橙", "Name": "赤焰冠", "Sex": "男", "Type": "头饰", "威严": 2, "精致": 3, "侠客": 4, "礼服": 4},
    {"装颜": "橙", "Name": "问青天", "Sex": "男", "Type": "发型", "青春": 2, "文人": 4, "侠客": 4, "简约": 3},
    {"装颜": "橙", "Name": "穿扬", "Sex": "男", "Type": "配饰", "繁华": 2, "战争": 4, "侠客": 4, "威严": 3},
    {"装颜": "橙", "Name": "赤焰长袍", "Sex": "男", "Type": "服饰", "保暖": 3, "战争": 4, "侠客": 4, "甲胄": 3},
    {"装颜": "橙", "Name": "见壳项圈", "Sex": "男", "Type": "缀饰", "演戏": 2, "活泼": 2, "侠客": 4, "简约": 4},
    {"装颜": "橙", "Name": "射日弓", "Sex": "男", "Type": "手持", "威严": 2, "战争": 4, "侠客": 4, "弓箭": 3},
    //春贺新喜
    {"装颜": "橙", "Name": "金玉幢", "Sex": "男", "Type": "头饰", "适温": 5, "精致": 3, "冠": 2, "礼服": 4},
    {"装颜": "橙", "Name": "凝烟", "Sex": "男", "Type": "发型", "成熟": 4, "发髻": 2, "风流": 2, "礼服": 4},
    {"装颜": "橙", "Name": "千里翠锦", "Sex": "男", "Type": "配饰", "适温": 3, "礼服": 4, "禁步": 2, "精致": 5},
    {"装颜": "橙", "Name": "春贺新喜", "Sex": "男", "Type": "服饰", "汉族": 2, "红": 2, "古代": 4, "礼服": 4},
    {"装颜": "橙", "Name": "额罗彩胜", "Sex": "男", "Type": "缀饰", "汉族": 2, "青": 2, "古代": 4, "礼服": 4},
    {"装颜": "橙", "Name": "福到万家", "Sex": "男", "Type": "手持", "灯": 2, "风流": 3, "古代": 4, "礼服": 4},
    //繁华落尽
    {"装颜": "橙", "Name": "火焰冠", "Sex": "男", "Type": "头饰", "成熟": 3, "战争": 4, "官服": 4, "威严": 3},
    {"装颜": "橙", "Name": "临江山", "Sex": "男", "Type": "发型", "成熟": 3, "威严": 3, "侠客": 4, "休闲": 4},
    {"装颜": "橙", "Name": "银烛照", "Sex": "男", "Type": "配饰", "风流": 2, "繁华": 3, "侠客": 4, "礼服": 4},
    {"装颜": "橙", "Name": "朔风袍", "Sex": "男", "Type": "服饰", "成熟": 3, "繁华": 2, "威严": 4, "礼服": 4},
    {"装颜": "橙", "Name": "离思", "Sex": "男", "Type": "缀饰", "青春": 3, "官服": 3, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "潇湘剑", "Sex": "男", "Type": "手持", "佩剑": 2, "战争": 3, "侠客": 4, "勇猛": 4},
    //风光月霁
    {"装颜": "橙", "Name": "沉水冠", "Sex": "男", "Type": "头饰", "成熟": 3, "适温": 2, "风流": 3, "礼服": 4},
    {"装颜": "橙", "Name": "晓星", "Sex": "男", "Type": "发型", "黑": 2, "古代": 3, "风流": 3, "礼服": 4},
    {"装颜": "橙", "Name": "灯影幢幢", "Sex": "男", "Type": "配饰", "黄": 3, "繁华": 2, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "祈夭寿", "Sex": "男", "Type": "服饰", "适温": 3, "风流": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "水宫佩", "Sex": "男", "Type": "缀饰", "汉族": 3, "紫": 3, "风流": 3, "礼服": 4},
    {"装颜": "橙", "Name": "玉虚灯", "Sex": "男", "Type": "手持", "繁华": 2, "灯": 3, "风流": 4, "礼服": 4},
    //香雪海
    {"装颜": "橙", "Name": "傲雪冠", "Sex": "男", "Type": "头饰", "黄": 2, "精致": 3, "儒雅": 4, "礼服": 4},
    {"装颜": "橙", "Name": "千堆雪", "Sex": "男", "Type": "发型", "休闲": 2, "古代": 2, "儒雅": 4, "礼服": 3},
    {"装颜": "橙", "Name": "雪貂裘", "Sex": "男", "Type": "配饰", "礼服": 2, "儒雅": 3, "保暖": 3, "休闲": 4},
    {"装颜": "橙", "Name": "暗香浮动", "Sex": "男", "Type": "服饰", "成熟": 3, "儒雅": 3, "繁华": 3, "礼服": 4},
    {"装颜": "橙", "Name": "飞雪佩", "Sex": "男", "Type": "缀饰", "成熟": 3, "礼服": 3, "儒雅": 3, "精致": 4},
    {"装颜": "橙", "Name": "折梅", "Sex": "男", "Type": "手持", "成熟": 3, "简约": 3, "儒雅": 3, "休闲": 3},
    //日夏盛暑
    {"装颜": "橙", "Name": "送清风", "Sex": "男", "Type": "头饰", "儒雅": 2, "头带": 2, "古代": 5, "休闲": 4},
    {"装颜": "橙", "Name": "消烦暑", "Sex": "男", "Type": "发型", "青春": 2, "精致": 3, "古代": 5, "休闲": 5},
    {"装颜": "橙", "Name": "大暑退", "Sex": "男", "Type": "配饰", "黑": 5, "汉族": 3, "青春": 2, "休闲": 4},
    {"装颜": "橙", "Name": "彼心静", "Sex": "男", "Type": "服饰", "黑": 2, "锦缎": 4, "清凉": 3, "休闲": 4},
    {"装颜": "橙", "Name": "枕簟清", "Sex": "男", "Type": "缀饰", "汉族": 3, "清凉": 5, "精致": 4, "休闲": 5},
    {"装颜": "橙", "Name": "天落叶风", "Sex": "男", "Type": "手持", "儒雅": 2, "清凉": 5, "花": 2, "休闲": 4},
    //银狐
    {"装颜": "橙", "Name": "狐耳", "Sex": "男", "Type": "头饰", "风流": 2, "神仙": 4, "演戏": 3, "精致": 2},
    {"装颜": "橙", "Name": "云间月", "Sex": "男", "Type": "发型", "成熟": 2, "风流": 2, "武士": 4, "官服": 3},
    {"装颜": "橙", "Name": "狐珠", "Sex": "男", "Type": "配饰", "精致": 3, "神仙": 4, "风流": 4, "礼服": 3},
    {"装颜": "橙", "Name": "九尾之妖", "Sex": "男", "Type": "服饰", "精致": 3, "神仙": 4, "风流": 4, "礼服": 3},
    {"装颜": "橙", "Name": "狐尾", "Sex": "男", "Type": "缀饰", "童真": 2, "活泼": 4, "白": 3, "休闲": 3},
    {"装颜": "橙", "Name": "珠链", "Sex": "男", "Type": "手持", "礼佛": 4, "成熟": 3, "儒雅": 4, "珠串": 2},
    //鹤桥仙
    {"装颜": "橙", "Name": "金风玉霜", "Sex": "男", "Type": "头饰", "成熟": 2, "神仙": 4, "儒雅": 3, "精致": 4},
    {"装颜": "橙", "Name": "云渺", "Sex": "男", "Type": "发型", "青春": 2, "神仙": 4, "风流": 3, "精致": 4},
    {"装颜": "橙", "Name": "银河微浪", "Sex": "男", "Type": "配饰", "青春": 2, "神仙": 4, "简约": 4, "风流": 3},
    {"装颜": "橙", "Name": "烟花易冷", "Sex": "男", "Type": "服饰", "成熟": 2, "神仙": 4, "儒雅": 3, "精致": 4},
    {"装颜": "橙", "Name": "燕妮香坠", "Sex": "男", "Type": "缀饰", "青春": 2, "神仙": 4, "简约": 4, "风流": 3},
    {"装颜": "橙", "Name": "风箫声断", "Sex": "男", "Type": "手持", "青春": 2, "神仙": 4, "简约": 4, "风流": 3},
    //霓裳羽衣
    {"装颜": "紫", "Name": "皓月流光", "Sex": "男", "Type": "头饰", "精致": 2, "文人": 4, "风流": 3, "休闲": 3},
    {"装颜": "紫", "Name": "碧云", "Sex": "男", "Type": "发型", "简约": 2, "风流": 3, "侠客": 4, "休闲": 3},
    {"装颜": "紫", "Name": "曼罗带", "Sex": "男", "Type": "配饰", "宴会": 4, "文人": 3, "风流": 3, "飘带": 2},
    {"装颜": "紫", "Name": "春无极", "Sex": "男", "Type": "服饰", "风流": 3, "文人": 4, "官服": 3, "精致": 2},
    {"装颜": "紫", "Name": "翠屏佩", "Sex": "男", "Type": "缀饰", "简约": 2, "文人": 4, "儒雅": 3, "休闲": 3},
    {"装颜": "紫", "Name": "映澈壶", "Sex": "男", "Type": "手持", "宴会": 4, "文人": 3, "风流": 3, "酒壶": 1},
    //芳情雀艳
    {"装颜": "紫", "Name": "鸳鸯细带", "Sex": "男", "Type": "头饰", "风流": 2, "神仙": 4, "古代": 4, "精致": 2},
    {"装颜": "紫", "Name": "翠角高耸", "Sex": "男", "Type": "发型", "束发": 3, "神仙": 4, "古代": 3, "精致": 3},
    {"装颜": "紫", "Name": "金尾凭风", "Sex": "男", "Type": "配饰", "成熟": 2, "神仙": 4, "古代": 3, "披帛": 3},
    {"装颜": "紫", "Name": "孔雀罗衫", "Sex": "男", "Type": "服饰", "成熟": 2, "神仙": 4, "风流": 4, "青": 3},
    {"装颜": "紫", "Name": "金华焕相", "Sex": "男", "Type": "缀饰", "汉族": 2, "神仙": 4, "古代": 3, "黄": 2},
    {"装颜": "紫", "Name": "芳情雀艳", "Sex": "男", "Type": "手持", "汉族": 2, "神仙": 4, "古代": 3, "黄": 2},
    //镜花缘
    {"装颜": "紫", "Name": "桃花流水", "Sex": "男", "Type": "头饰", "黑": 2, "精致": 2, "儒雅": 4, "休闲": 4},
    {"装颜": "紫", "Name": "花语月", "Sex": "男", "Type": "发型", "青春": 4, "黑": 2, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "游鱼在水", "Sex": "男", "Type": "配饰", "黑": 3, "适温": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "镜花缘", "Sex": "男", "Type": "服饰", "黑": 4, "青春": 3, "儒雅": 2, "休闲": 4},
    {"装颜": "紫", "Name": "镜花颜", "Sex": "男", "Type": "缀饰", "黑": 4, "适温": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "朗月清风", "Sex": "男", "Type": "手持", "黑": 2, "玩偶": 3, "青春": 2, "休闲": 4},
    //三世桃花
    {"装颜": "紫", "Name": "桃花凉", "Sex": "男", "Type": "头饰", "冠": 2, "神仙": 4, "黑": 2, "适温": 2},
    {"装颜": "紫", "Name": "洗梧", "Sex": "男", "Type": "发型", "成熟": 3, "神仙": 4, "黑": 3, "发髻": 2},
    {"装颜": "紫", "Name": "难相忘", "Sex": "男", "Type": "配饰", "黑": 3, "神仙": 4, "古代": 3, "汉族": 2},
    {"装颜": "紫", "Name": "夜华君", "Sex": "男", "Type": "服饰", "成熟": 2, "神仙": 4, "风流": 3, "锦缎": 2},
    {"装颜": "紫", "Name": "恍然一梦", "Sex": "男", "Type": "缀饰", "黑": 3, "神仙": 4, "成熟": 2, "精致": 3},
    {"装颜": "紫", "Name": "青冥剑", "Sex": "男", "Type": "手持", "成熟": 2, "神仙": 4, "黑": 2, "精致": 4},
    //菡萏华池
    {"装颜": "紫", "Name": "飞霜满", "Sex": "男", "Type": "头饰", "汉族": 4, "白": 3, "成熟": 2, "休闲": 4},
    {"装颜": "紫", "Name": "罗青烟", "Sex": "男", "Type": "发型", "适温": 3, "黑": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "生幽泉", "Sex": "男", "Type": "配饰", "成熟": 2, "古代": 3, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "菡萏华池", "Sex": "男", "Type": "服饰", "汉族": 4, "白": 3, "成熟": 2, "休闲": 4},
    {"装颜": "紫", "Name": "秀色绝世", "Sex": "男", "Type": "缀饰", "汉族": 4, "绿": 3, "成熟": 2, "休闲": 4},
    {"装颜": "紫", "Name": "碧荷鲜", "Sex": "男", "Type": "手持", "休闲": 4, "绿": 2, "花": 2, "精致": 4},
    //画堂春
    {"装颜": "紫", "Name": "水沉一缕", "Sex": "男", "Type": "头饰", "适温": 3, "黑": 2, "儒雅": 4, "休闲": 4},
    {"装颜": "紫", "Name": "浅黛春山", "Sex": "男", "Type": "发型", "青春": 4, "精致": 2, "适温": 2, "休闲": 4},
    {"装颜": "紫", "Name": "尽醉芳尊", "Sex": "男", "Type": "配饰", "适温": 3, "飘带": 3, "黑": 2, "休闲": 4},
    {"装颜": "紫", "Name": "舞袖飘摇", "Sex": "男", "Type": "服饰", "青春": 2, "锦缎": 3, "黑": 2, "休闲": 4},
    {"装颜": "紫", "Name": "雨霁风光", "Sex": "男", "Type": "缀饰", "青春": 2, "手链": 3, "黑": 2, "休闲": 4},
    {"装颜": "紫", "Name": "半开桃李", "Sex": "男", "Type": "手持", "汉族": 3, "玩偶": 2, "青春": 2, "休闲": 4},
    //灯影相思
    {"装颜": "紫", "Name": "夜来皓月", "Sex": "男", "Type": "头饰", "汉族": 3, "青春": 2, "适温": 2, "休闲": 4},
    {"装颜": "紫", "Name": "上阳春晚", "Sex": "男", "Type": "发型", "披发": 1, "风流": 3, "古代": 4, "休闲": 4},
    {"装颜": "紫", "Name": "罗带惹香", "Sex": "男", "Type": "配饰", "古代": 2, "飘带": 4, "儒雅": 3, "休闲": 2},
    {"装颜": "紫", "Name": "竹风轻动", "Sex": "男", "Type": "服饰", "青春": 2, "冷色调": 2, "古代": 4, "休闲": 4},
    {"装颜": "紫", "Name": "归国遥望", "Sex": "男", "Type": "缀饰", "古代": 2, "精致": 2, "保暖": 3, "玉佩": 4},
    {"装颜": "紫", "Name": "翠翘金缕", "Sex": "男", "Type": "手持", "灯": 1, "风流": 3, "古代": 4, "休闲": 4},
    //清澄如月
    {"装颜": "紫", "Name": "孤月", "Sex": "男", "Type": "头饰", "适温": 3, "冠": 2, "精致": 2, "礼服": 4},
    {"装颜": "紫", "Name": "纤尘", "Sex": "男", "Type": "发型", "适温": 3, "风流": 2, "精致": 2, "礼服": 4},
    {"装颜": "紫", "Name": "月徘徊", "Sex": "男", "Type": "配饰", "适温": 3, "披肩": 2, "风流": 3, "礼服": 4},
    {"装颜": "紫", "Name": "清澄如月", "Sex": "男", "Type": "服饰", "成熟": 3, "精致": 2, "古代": 3, "礼服": 4},
    {"装颜": "橙", "Name": "梦落花", "Sex": "男", "Type": "缀饰", "腰饰": 2, "精致": 3, "红": 3, "礼服": 4},
    {"装颜": "橙", "Name": "月华扇", "Sex": "男", "Type": "手持", "适温": 2, "精致": 2, "风流": 3, "礼服": 4},
    //奇幻之夜
    {"装颜": "紫", "Name": "恶魔之角", "Sex": "男", "Type": "头饰", "成熟": 3, "欧洲": 2, "近代": 2, "鬼": 4},
    {"装颜": "紫", "Name": "银色月光", "Sex": "男", "Type": "发型", "披发": 2, "青": 3, "风流": 3, "鬼": 4},
    {"装颜": "紫", "Name": "幻夜披风", "Sex": "男", "Type": "配饰", "欧洲": 3, "紫": 2, "恐怖": 4, "鬼": 4},
    {"装颜": "紫", "Name": "奇幻之夜", "Sex": "男", "Type": "服饰", "成熟": 3, "欧洲": 3, "恐怖": 3, "鬼": 4},
    {"装颜": "紫", "Name": "灯火流苏", "Sex": "男", "Type": "缀饰", "欧洲": 3, "腰带": 2, "恐怖": 3, "鬼": 4},
    {"装颜": "紫", "Name": "小恶魔之灯", "Sex": "男", "Type": "手持", "繁华": 2, "欧洲": 3, "恐怖": 3, "鬼": 4},
    //云霏仙羽
    {"装颜": "紫", "Name": "临水", "Sex": "男", "Type": "头饰", "成熟": 4, "古代": 2, "繁华": 2, "礼服": 4},
    {"装颜": "紫", "Name": "晓寒", "Sex": "男", "Type": "发型", "汉族": 4, "风流": 2, "古代": 2, "礼服": 4},
    {"装颜": "紫", "Name": "寒泉", "Sex": "男", "Type": "配饰", "繁华": 2, "古代": 3, "保暖": 4, "礼服": 4},
    {"装颜": "紫", "Name": "银羽翠仙", "Sex": "男", "Type": "服饰", "成熟": 2, "繁华": 2, "古代": 2, "礼服": 4},
    {"装颜": "紫", "Name": "晴轩", "Sex": "男", "Type": "缀饰", "成熟": 3, "礼服": 4, "汉族": 2, "白": 4},
    {"装颜": "紫", "Name": "破雪", "Sex": "男", "Type": "手持", "成熟": 3, "汉族": 2, "风流": 2, "礼服": 4},
    //魅雪凌狐
    {"装颜": "紫", "Name": "呈瑞", "Sex": "男", "Type": "头饰", "青春": 3, "白": 2, "保暖": 4, "休闲": 4},
    {"装颜": "紫", "Name": "清寒", "Sex": "男", "Type": "发型", "青春": 2, "活泼": 3, "古代": 3, "休闲": 4},
    {"装颜": "紫", "Name": "雪狐", "Sex": "男", "Type": "配饰", "汉族": 2, "白": 2, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "初雪", "Sex": "男", "Type": "服饰", "青春": 4, "活泼": 2, "白": 2, "休闲": 4},
    {"装颜": "紫", "Name": "清霜", "Sex": "男", "Type": "缀饰", "青春": 4, "活泼": 2, "白": 2, "休闲": 4},
    {"装颜": "紫", "Name": "狐面", "Sex": "男", "Type": "手持", "青春": 2, "繁华": 2, "保暖": 2, "休闲": 4},
    //烟光凝
    {"装颜": "紫", "Name": "烟光凝", "Sex": "男", "Type": "头饰", "适温": 3, "文人": 4, "儒雅": 3, "汉族": 2},
    {"装颜": "紫", "Name": "寒潭清", "Sex": "男", "Type": "发型", "汉族": 3, "文人": 4, "儒雅": 4, "古代": 2},
    {"装颜": "紫", "Name": "西山雨", "Sex": "男", "Type": "配饰", "成熟": 2, "文人": 4, "儒雅": 3, "精致": 2},
    {"装颜": "紫", "Name": "闲云潭影", "Sex": "男", "Type": "服饰", "适温": 3, "文人": 4, "儒雅": 3, "汉族": 2},
    {"装颜": "紫", "Name": "佩玉鸣鸾", "Sex": "男", "Type": "缀饰", "适温": 3, "文人": 4, "儒雅": 3, "汉族": 2},
    {"装颜": "紫", "Name": "几度秋", "Sex": "男", "Type": "手持", "适温": 3, "文人": 4, "儒雅": 3, "汉族": 2},
    //盛世红装
    {"装颜": "紫", "Name": "红莲冠", "Sex": "男", "Type": "头饰", "成熟": 4, "冠": 2, "武士": 4, "古代": 2},
    {"装颜": "紫", "Name": "墨色", "Sex": "男", "Type": "发型", "成熟": 4, "束发": 2, "武士": 4, "古代": 2},
    {"装颜": "紫", "Name": "红莲碎", "Sex": "男", "Type": "配饰", "禁步": 4, "适温": 2, "武士": 4, "古代": 2},
    {"装颜": "紫", "Name": "红莲之华", "Sex": "男", "Type": "服饰", "勇猛": 2, "红": 3, "武士": 4, "精致": 2},
    {"装颜": "紫", "Name": "红莲坠", "Sex": "男", "Type": "缀饰", "适温": 4, "红": 2, "武士": 4, "古代": 2},
    {"装颜": "紫", "Name": "红莲剑", "Sex": "男", "Type": "手持", "适温": 4, "红": 2, "武士": 4, "古代": 2},
    //千蝶迷踪
    {"装颜": "紫", "Name": "惑众生", "Sex": "男", "Type": "头饰", "民族风": 3, "白": 2, "舞蹈": 4, "精致": 3},
    {"装颜": "紫", "Name": "解情丝", "Sex": "男", "Type": "发型", "民族风": 3, "黑": 2, "舞蹈": 4, "精致": 3},
    {"装颜": "紫", "Name": "千蝶迷踪", "Sex": "男", "Type": "配饰", "民族风": 2, "古代": 2, "舞蹈": 4, "风流": 2},
    {"装颜": "紫", "Name": "戏江湖", "Sex": "男", "Type": "服饰", "民族风": 2, "紫": 2, "舞蹈": 4, "风流": 2},
    {"装颜": "紫", "Name": "啸残月", "Sex": "男", "Type": "缀饰", "民族风": 2, "紫": 2, "舞蹈": 4, "风流": 2},
    {"装颜": "紫", "Name": "清音铃", "Sex": "男", "Type": "手持", "民族风": 2, "古代": 2, "舞蹈": 4, "风流": 2},
    //风月情浓
    {"装颜": "紫", "Name": "飞星传恨", "Sex": "男", "Type": "头饰", "适温": 3, "青春": 2, "风流": 2, "礼服": 4},
    {"装颜": "紫", "Name": "纤云弄巧", "Sex": "男", "Type": "发型", "适温": 3, "汉族": 3, "精致": 2, "礼服": 4},
    {"装颜": "紫", "Name": "佳期如梦", "Sex": "男", "Type": "配饰", "适温": 3, "汉族": 2, "风流": 2, "礼服": 4},
    {"装颜": "紫", "Name": "风月情浓", "Sex": "男", "Type": "服饰", "青春": 3, "锦缎": 3, "适温": 2, "礼服": 4},
    {"装颜": "紫", "Name": "银汉迢迢", "Sex": "男", "Type": "缀饰", "适温": 3, "礼服": 4, "汉族": 2, "精致": 4},
    {"装颜": "紫", "Name": "柔情似水", "Sex": "男", "Type": "手持", "适温": 3, "礼服": 4, "汉族": 2, "精致": 4},
    //风帘翠幕
    {"装颜": "紫", "Name": "绕提沙", "Sex": "男", "Type": "头饰", "成熟": 3, "清凉": 4, "青": 2, "休闲": 4},
    {"装颜": "紫", "Name": "烟柳画桥", "Sex": "男", "Type": "发型", "汉族": 3, "清凉": 3, "古代": 2, "休闲": 4},
    {"装颜": "紫", "Name": "吟赏烟霾", "Sex": "男", "Type": "配饰", "动物": 2, "青": 2, "儒雅": 3, "休闲": 4},
    {"装颜": "紫", "Name": "风帘翠幕", "Sex": "男", "Type": "服饰", "汉族": 2, "青": 3, "清凉": 2, "休闲": 4},
    {"装颜": "紫", "Name": "卷霜雪", "Sex": "男", "Type": "缀饰", "腰饰": 2, "精致": 2, "古代": 3, "休闲": 4},
    {"装颜": "紫", "Name": "醉听箫鼓", "Sex": "男", "Type": "手持", "乐器": 2, "青": 2, "儒雅": 3, "休闲": 4},
    //黯然销魂
    {"装颜": "紫", "Name": "雁山参云", "Sex": "男", "Type": "头饰", "成熟": 3, "威严": 2, "古代": 2, "道士": 4},
    {"装颜": "紫", "Name": "云之墨妙", "Sex": "男", "Type": "发型", "成熟": 2, "黑": 2, "披发": 2, "道士": 4},
    {"装颜": "紫", "Name": "别魂飞扬", "Sex": "男", "Type": "配饰", "成熟": 2, "威严": 2, "古代": 2, "道士": 4},
    {"装颜": "紫", "Name": "黯然销魂", "Sex": "男", "Type": "服饰", "成熟": 3, "威严": 2, "古代": 3, "道士": 4},
    {"装颜": "紫", "Name": "秋霾如珠", "Sex": "男", "Type": "缀饰", "成熟": 2, "威严": 2, "古代": 2, "道士": 4},
    {"装颜": "紫", "Name": "清秋离霜", "Sex": "男", "Type": "手持", "成熟": 2, "威严": 2, "古代": 2, "道士": 4},
    //遏云倩雪
    {"装颜": "紫", "Name": "移缣素", "Sex": "男", "Type": "头饰", "黑": 3, "文人": 4, "冠": 2, "成熟": 3},
    {"装颜": "紫", "Name": "香丝袅袅", "Sex": "男", "Type": "发型", "汉族": 2, "文人": 4, "儒雅": 3, "古代": 3},
    {"装颜": "紫", "Name": "向南枝", "Sex": "男", "Type": "配饰", "儒雅": 3, "文人": 4, "古代": 3, "精致": 2},
    {"装颜": "紫", "Name": "遏云倩雪", "Sex": "男", "Type": "服饰", "黑": 3, "文人": 4, "沙罗": 2, "成熟": 3},
    {"装颜": "紫", "Name": "琼英飞", "Sex": "男", "Type": "缀饰", "汉族": 2, "文人": 4, "腰饰": 2, "白": 2},
    {"装颜": "紫", "Name": "秋光晚", "Sex": "男", "Type": "手持", "成熟": 2, "文人": 4, "黑": 2, "精致": 3},
    //花月夜
    {"装颜": "蓝", "Name": "流照君", "Sex": "男", "Type": "头饰", "青春": 3, "白": 2, "风流": 2, "休闲": 3},
    {"装颜": "蓝", "Name": "青枫", "Sex": "男", "Type": "发型", "成熟": 2, "披发": 2, "演戏": 3, "精致": 2},
    {"装颜": "蓝", "Name": "曜隐", "Sex": "男", "Type": "配饰", "适温": 2, "古代": 3, "舞蹈": 3, "威严": 3},
    {"装颜": "蓝", "Name": "九阙华重", "Sex": "男", "Type": "服饰", "丧服": 3, "锦缎": 3, "简约": 2, "威严": 2},
    {"装颜": "蓝", "Name": "流萤灯", "Sex": "男", "Type": "手持", "童真": 2, "活泼": 3, "演戏": 3, "古代": 3},
    //大漠孤烟
    {"装颜": "蓝", "Name": "鸿羽", "Sex": "男", "Type": "头饰", "青春": 2, "运动": 3, "风流": 3, "侠客": 2},
    {"装颜": "蓝", "Name": "自飘零", "Sex": "男", "Type": "发型", "青春": 2, "风流": 3, "武士": 3, "休闲": 2},
    {"装颜": "蓝", "Name": "一株雪", "Sex": "男", "Type": "配饰", "威严": 3, "繁华": 2, "武士": 3, "礼服": 2},
    {"装颜": "蓝", "Name": "残雪袍", "Sex": "男", "Type": "服饰", "青春": 2, "运动": 3, "威严": 3, "侠客": 2},
    {"装颜": "蓝", "Name": "罗红坠", "Sex": "男", "Type": "缀饰", "青春": 2, "运动": 3, "风流": 3, "侠客": 2},
    {"装颜": "蓝", "Name": "轻羽扇", "Sex": "男", "Type": "手持", "精致": 2, "文人": 4, "风流": 2, "休闲": 3},
    //其他
    //一池春水
    {"装颜": "橙", "Name": "碎金冠", "Sex": "男", "Type": "头饰", "繁华": 3, "官服": 3, "风流": 4, "礼服": 4},
    {"装颜": "橙", "Name": "烟水茫茫", "Sex": "男", "Type": "发型", "青春": 3, "古代": 3, "儒雅": 3, "休闲": 4},
    {"装颜": "橙", "Name": "逝雪裘", "Sex": "男", "Type": "配饰", "青春": 2, "风流": 3, "保暖": 3, "帝服": 4},
    {"装颜": "橙", "Name": "青兰袍", "Sex": "男", "Type": "服饰", "青春": 2, "文人": 4, "儒雅": 5, "礼服": 2},
    {"装颜": "橙", "Name": "风吹楚", "Sex": "男", "Type": "缀饰", "适温": 3, "暖色调": 4, "风流": 3, "礼服": 4},
    {"装颜": "橙", "Name": "洞庭萧", "Sex": "男", "Type": "手持", "休闲": 2, "文人": 3, "风流": 4, "精致": 3},
    //鸾凤和鸣
    {"装颜": "橙", "Name": "贺新郎", "Sex": "男", "Type": "头饰", "青春": 4, "官服": 3, "婚庆": 4, "风流": 3},
    {"装颜": "橙", "Name": "逢春", "Sex": "男", "Type": "发型", "青春": 4, "文人": 3, "婚庆": 4, "儒雅": 3},
    {"装颜": "橙", "Name": "喜结良缘", "Sex": "男", "Type": "配饰", "青春": 3, "活泼": 2, "婚庆": 4, "精致": 4},
    {"装颜": "橙", "Name": "缘定三生", "Sex": "男", "Type": "服饰", "青春": 3, "锦缎": 3, "婚庆": 4, "繁华": 4},
    {"装颜": "橙", "Name": "同心锁", "Sex": "男", "Type": "缀饰", "青春": 3, "长命锁": 3, "婚庆": 4, "精致": 4},
    {"装颜": "橙", "Name": "合欢酒壶", "Sex": "男", "Type": "手持", "青春": 3, "风流": 2, "婚庆": 4, "精致": 4},
    //公子无双
    {"装颜": "紫", "Name": "无双红钗", "Sex": "男", "Type": "头饰", "适温": 2, "风流": 2, "舞蹈": 4, "古代": 3},
    {"装颜": "紫", "Name": "无双倾城", "Sex": "男", "Type": "发型", "青春": 3, "风流": 3, "舞蹈": 4, "休闲": 2},
    {"装颜": "紫", "Name": "天下无双", "Sex": "男", "Type": "配饰", "青春": 3, "古代": 2, "舞蹈": 4, "风流": 4},
    {"装颜": "紫", "Name": "公子无双", "Sex": "男", "Type": "服饰", "青春": 2, "风流": 4, "舞蹈": 4, "精致": 2},
    {"装颜": "紫", "Name": "无双丝绦", "Sex": "男", "Type": "缀饰", "青春": 2, "风流": 3, "舞蹈": 4, "精致": 2},
    {"装颜": "紫", "Name": "半掩妃扇", "Sex": "男", "Type": "手持", "青春": 3, "风流": 2, "舞蹈": 4, "扇子": 3},
    //樱花舞
    {"装颜": "紫", "Name": "寒星发带", "Sex": "男", "Type": "头饰", "日本": 4, "青春": 2, "风流": 3, "侠客": 3},
    {"装颜": "紫", "Name": "风吹雨", "Sex": "男", "Type": "发型", "日本": 4, "青春": 2, "风流": 3, "侠客": 3},
    {"装颜": "紫", "Name": "护肩", "Sex": "男", "Type": "配饰", "日本": 4, "勇猛": 2, "侠客": 3, "刺客": 3},
    {"装颜": "紫", "Name": "武士道", "Sex": "男", "Type": "服饰", "日本": 4, "青春": 2, "勇猛": 3, "侠客": 3},
    {"装颜": "紫", "Name": "红澜缀", "Sex": "男", "Type": "缀饰", "日本": 4, "青春": 2, "儒雅": 3, "侠客": 3},
    {"装颜": "紫", "Name": "武士刀", "Sex": "男", "Type": "手持", "日本": 4, "勇猛": 2, "侠客": 3, "刺客": 3},
    //倾城曲
    {"装颜": "蓝", "Name": "归鸿", "Sex": "男", "Type": "头饰", "丧服": 3, "披肩": 2, "保暖": 2, "恐怖": 2},
    {"装颜": "蓝", "Name": "落影沉", "Sex": "男", "Type": "发型", "丧服": 3, "简约": 1, "披发": 2, "恐怖": 2},
    {"装颜": "蓝", "Name": "浮容羽", "Sex": "男", "Type": "配饰", "成熟": 2, "汉族": 1, "黑": 1, "礼佛": 3},
    {"装颜": "蓝", "Name": "游龙", "Sex": "男", "Type": "服饰", "汉族": 3, "威严": 3, "武士": 3, "精致": 2},
    {"装颜": "蓝", "Name": "云思", "Sex": "男", "Type": "缀饰", "青春": 1, "文人": 3, "儒雅": 2, "休闲": 1},
    {"装颜": "蓝", "Name": "暗香", "Sex": "男", "Type": "手持", "白": 2, "活泼": 3, "花": 2, "礼服": 3},
    //龙凤呈祥
    {"装颜": "蓝", "Name": "龙凤冠", "Sex": "男", "Type": "头饰", "成熟": 2, "儒雅": 3, "婚庆": 3, "精致": 2},
    {"装颜": "蓝", "Name": "和光同尘", "Sex": "男", "Type": "发型", "成熟": 2, "适温": 1, "婚庆": 3, "儒雅": 3},
    {"装颜": "蓝", "Name": "合欢偕老", "Sex": "男", "Type": "配饰", "成熟": 2, "儒雅": 3, "婚庆": 3, "精致": 2},
    {"装颜": "蓝", "Name": "龙凤纹喜服", "Sex": "男", "Type": "服饰", "成熟": 2, "锦缎": 1, "婚庆": 3, "儒雅": 3},
    {"装颜": "蓝", "Name": "龙凤玉佩", "Sex": "男", "Type": "缀饰", "古代": 2, "儒雅": 2, "婚庆": 3, "精致": 3},
    {"装颜": "蓝", "Name": "龙凤酒樽", "Sex": "男", "Type": "手持", "成熟": 2, "儒雅": 2, "婚庆": 3, "精致": 2},
    //比翼双飞
    {"装颜": "蓝", "Name": "同心发带", "Sex": "男", "Type": "头饰", "简约": 2, "文人": 3, "婚庆": 3, "风流": 2},
    {"装颜": "蓝", "Name": "鸳鸯栖", "Sex": "男", "Type": "发型", "简约": 2, "文人": 3, "婚庆": 3, "儒雅": 2},
    {"装颜": "蓝", "Name": "佩玉鸣鸾", "Sex": "男", "Type": "配饰", "宴会": 3, "风流": 1, "婚庆": 3, "精致": 2},
    {"装颜": "蓝", "Name": "锦绣良缘", "Sex": "男", "Type": "服饰", "儒雅": 2, "锦缎": 3, "婚庆": 3, "精致": 2},
    {"装颜": "蓝", "Name": "龙呈百福", "Sex": "男", "Type": "缀饰", "精致": 2, "儒雅": 2, "婚庆": 3, "玉佩": 3},
    {"装颜": "蓝", "Name": "喜秤", "Sex": "男", "Type": "手持", "青春": 2, "简约": 2, "婚庆": 3, "风流": 2},
    //青青子衿
    {"装颜": "灰", "Name": "子衿白玉冠", "Sex": "男", "Type": "头饰", "精致": 1, "休闲": 1, "威严": 2, "礼服": 2},
    {"装颜": "灰", "Name": "顶束小髻", "Sex": "男", "Type": "发型", "成熟": 1, "发髻": 1, "威严": 1, "精致": 1},
    {"装颜": "灰", "Name": "诗经.子衿", "Sex": "男", "Type": "配饰", "成熟": 2, "文人": 2, "儒雅": 2, "休闲": 2},
    {"装颜": "灰", "Name": "青青子衿", "Sex": "男", "Type": "服饰", "成熟": 2, "威严": 2, "官服": 2, "繁华": 2},
    {"装颜": "灰", "Name": "子衿环佩", "Sex": "男", "Type": "缀饰", "成熟": 1, "礼服": 1, "官服": 2, "精致": 2},
    {"装颜": "灰", "Name": "鹤之羽披风", "Sex": "男", "Type": "手持", "成熟": 1, "官服": 2, "繁华": 2, "礼服": 2},
    //悬壶弃世
    {"装颜": "灰", "Name": "流苏缠枝簪", "Sex": "男", "Type": "头饰", "礼服": 1, "青": 1, "儒雅": 2, "精致": 2},
    {"装颜": "灰", "Name": "清如许", "Sex": "男", "Type": "发型", "成熟": 2, "休闲": 1, "儒雅": 2, "礼服": 2},
    {"装颜": "灰", "Name": "断肠草", "Sex": "男", "Type": "配饰", "青春": 1, "简约": 1, "舞蹈": 1, "休闲": 2},
    {"装颜": "灰", "Name": "悬壶弃世", "Sex": "男", "Type": "服饰", "青春": 2, "儒雅": 1, "古代": 2, "休闲": 2},
    {"装颜": "灰", "Name": "七虫七花膏", "Sex": "男", "Type": "缀饰", "青春": 1, "舞蹈": 2, "风流": 2, "休闲": 2},
    {"装颜": "灰", "Name": "断肠织棉", "Sex": "男", "Type": "手持", "青春": 2, "休闲": 1, "风流": 2, "精致": 2},
    //荒漠白焰
    {"装颜": "灰", "Name": "白焰银束冠", "Sex": "男", "Type": "头饰", "青春": 1, "武士": 2, "勇猛": 2, "精致": 2},
    {"装颜": "灰", "Name": "少年狂", "Sex": "男", "Type": "发型", "青春": 2, "简约": 1, "勇猛": 2, "黑": 1},
    {"装颜": "灰", "Name": "青锋白焰剑", "Sex": "男", "Type": "配饰", "青春": 2, "侠客": 2, "勇猛": 2, "武器": 2},
    {"装颜": "灰", "Name": "荒漠白焰", "Sex": "男", "Type": "服饰", "古代": 1, "侠客": 2, "勇猛": 2, "精致": 2},
    {"装颜": "灰", "Name": "白焰虎符", "Sex": "男", "Type": "缀饰", "成熟": 1, "战争": 2, "威严": 1, "精致": 2},
    {"装颜": "灰", "Name": "白焰披风", "Sex": "男", "Type": "手持", "官服": 1, "战争": 1, "威严": 2, "披风": 2},
];

Array.prototype.stableSort = function(cmp) {
  cmp = !!cmp ? cmp : (a, b) => {
    if (a < b) return -1;
    if (a > b) return 1;
    return 0;
  };
  let stabilizedThis = this.map((el, index) => [el, index]);
  let stableCmp = (a, b) => {
    let order = cmp(a[0], b[0]);
    if (order != 0) return order;
    return a[1] - b[1];
  }
  stabilizedThis.sort(stableCmp);
  for (let i=0; i<this.length; i++) {
    this[i] = stabilizedThis[i][0];
  }
  return this;
}


function onclickType() {
    for (var i = 0; i < typeList.length; i++) {
        typeList[i].addEventListener('click', bindFunction, false);
    }
}

function onclickProps() {
    for (var i = 0; i < propList.length; i++) {
        propList[i].addEventListener('click', bindFunction, false);
    }
}

function bindFunction() {
    document.getElementById("demo").innerHTML = mainFunction();
}


function mainFunction() {
    var new_clothes = [];
//filter by sex & type, push into new array new_clothes
    var maleIndicator = false;
    var femaleIndicator = false;
    var headwearIndicator = false;
    var hairstyleIndicator = false;
    var accessoriesIndicator = false;
    var apparelIndicator = false;
    var embellishedIndicator = false;
    var handheldIndicator = false;
    for (var j = 0; j < typeList.length; j++) {
        if (typeList[j].checked) {
            var type = typeList[j].nextElementSibling.innerText;
            switch (type) {
                case '男':
                    maleIndicator = true;
                    break;
                case '女':
                    femaleIndicator = true;
                    break;
                case '头饰':
                    headwearIndicator = true;
                    break;
                case '发型':
                    hairstyleIndicator = true;
                    break;
                case '配饰':
                    accessoriesIndicator = true;
                    break;
                case '服饰':
                    apparelIndicator = true;
                    break;
                case '缀饰':
                    embellishedIndicator = true;
                    break;
                case '手持':
                    handheldIndicator = true;
                    break;
            }
        }
    }
    for (var i = 0; i < clothes.length; i++) {
        if ((maleIndicator || femaleIndicator || headwearIndicator ||
            hairstyleIndicator || accessoriesIndicator || apparelIndicator ||
            embellishedIndicator || handheldIndicator) &&
            (!maleIndicator || !femaleIndicator || !headwearIndicator ||
                !hairstyleIndicator || !accessoriesIndicator || !apparelIndicator ||
                !embellishedIndicator || !handheldIndicator)) {
            if ((maleIndicator && clothes[i]['Sex'] === '男') ||
                (femaleIndicator && clothes[i]['Sex'] === '女')) {
                if ((headwearIndicator && clothes[i]['Type'] === '头饰') ||
                    (hairstyleIndicator && clothes[i]['Type'] === '发型') ||
                    (accessoriesIndicator && clothes[i]['Type'] === '配饰') ||
                    (apparelIndicator && clothes[i]['Type'] === '服饰') ||
                    (embellishedIndicator && clothes[i]['Type'] === '缀饰') ||
                    (handheldIndicator && clothes[i]['Type'] === '手持')) {
                    new_clothes.push(clothes[i]);
                    continue;
                }
                if (!headwearIndicator && !hairstyleIndicator && !accessoriesIndicator &&
                    !apparelIndicator && !embellishedIndicator && !handheldIndicator) {
                    new_clothes.push(clothes[i]);
                    continue;
                }
            }
            if ((headwearIndicator && clothes[i]['Type'] === '头饰') ||
                (hairstyleIndicator && clothes[i]['Type'] === '发型') ||
                (accessoriesIndicator && clothes[i]['Type'] === '配饰') ||
                (apparelIndicator && clothes[i]['Type'] === '服饰') ||
                (embellishedIndicator && clothes[i]['Type'] === '缀饰') ||
                (handheldIndicator && clothes[i]['Type'] === '手持')) {
                if ((maleIndicator && clothes[i]['Sex'] === '男') ||
                    (femaleIndicator && clothes[i]['Sex'] === '女')) {
                    new_clothes.push(clothes[i]);
                    continue;
                }
                if (!maleIndicator && !femaleIndicator) {
                    new_clothes.push(clothes[i]);
                    continue;
                }
            }
        } else {
            new_clothes.push(clothes[i]);
        }
    }

    // accumulate props
    for (var i = 0; i < new_clothes.length; i++) {
        var accumProps = 0;
        for (var j = 0; j < propList.length; j++) {
            if (propList[j].checked == true) {
                for (var k = 0; k < Object.keys(new_clothes[i]).length; k++) {
                    if ((Object.keys(new_clothes[i])[k] != "Name") &&
                        (Object.keys(new_clothes[i])[k] != "Sex") &&
                        (Object.keys(new_clothes[i])[k] != "Type") &&
                        (Object.keys(new_clothes[i])[k] != "总数")) {
                        if (Object.keys(new_clothes[i])[k] ==
                            [propList[j].nextElementSibling.innerText]) {
                            accumProps += Object.values(new_clothes[i])[k];
                        }
                    }
                }
            }
        }
        new_clothes[i].总数 = accumProps;
    }
    new_clothes = sortArrayByValue(new_clothes, '总数');
    output = writeOutput(new_clothes);
    return output;
}

// sort by accumulation of charasteristic
function sortArrayByValue(array, key) {
    array.stableSort(function (a, b) {
            if (b[key] < a[key]) {
                return -1;
            }
            else if (a[key] < b[key]) {
                return 1;
            }
            else {
                return 0;
        		}
        }
    );
    return array;
}

// write output
function writeOutput(new_array) {
    var output = "";
    output += '<table class="resulttable">';
    for (var i = 0; i < new_array.length; i++) {
        var greyIndicator = false;
        var greenIndicator = false;
        var blueIndicator = false;
        var purpleIndicator = false;
        var orangeIndicator = false;
        var redIndicator = false;
        switch (Object.values(new_array[i])[0]) {
            case '灰':
                greyIndicator = true;
                break;
            case '青':
                greenIndicator = true;
                break;
            case '蓝':
                blueIndicator = true;
                break;
            case '紫':
                purpleIndicator = true;
                break;
            case '橙':
                orangeIndicator = true;
                break;
            case '红':
                redIndicator = true;
                break;
        }
        if (greyIndicator) {
            output += '<tr class=greytext>'
        } else if (greenIndicator) {
            output += '<tr class=greentext>'
        } else if (blueIndicator) {
            output += '<tr class=bluetext>'
        } else if (purpleIndicator) {
            output += '<tr class=purpletext>'
        } else if (orangeIndicator) {
            output += '<tr class=orangetext>'
        } else if (redIndicator) {
            output += '<tr class=redtext>'
        } else {
            output += '<tr>'
        }
        for (var k = 0; k < Object.keys(new_array[i]).length; k++) {
            if ((Object.keys(new_array[i])[k] == "装颜") ||
                (Object.keys(new_array[i])[k] == "Name") ||
                (Object.keys(new_array[i])[k] == "Sex") ||
                (Object.keys(new_array[i])[k] == "Type")) {
                output += '<td>' + Object.values(new_array[i])[k] + '</td>'
            } else {
                output += '<td>' + Object.keys(new_array[i])[k] + '</td>'
                output += '<td>' + Object.values(new_array[i])[k] + '</td>'
            }
        }
        output += '</tr>'
    }
    ;
    output += '</table>';
    return output;
}

/* ==============================================*/
/* =============== program start! ===============*/
/* ==============================================*/
// start
var typeList = document.getElementsByClassName("filterType");
var propList = document.getElementsByClassName("propsBox");
// init screen
document.getElementById("demo").innerHTML = mainFunction();
// on event
onclickType();
onclickProps();
